---
type: ExternalDataInstanceAddedIntoDocumentEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 4
tags: [revit-api, class]
---

# ExternalDataInstanceAddedIntoDocumentEventArgs

`Autodesk.Revit.DB.Events.ExternalDataInstanceAddedIntoDocumentEventArgs` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | ItemId | 2023 | `public string ItemId { get ; }` |
| Property | NewInstanceId | 2023 | `public ElementId NewInstanceId { get ; }` |
| Property | ProjectId | 2023 | `public string ProjectId { get ; }` |
| Property | TypeId | 2023 | `public ElementId TypeId { get ; }` |